// =================================================================================================
//  @file RenderCore.ixx
// 
//  @brief 그래픽 렌더러 코어
//  
//  @date 2022/12/13
// =================================================================================================
module;
export module KG.Renderer.Core.RenderCore;

import KG.Platform.Core.PlatformCore;

namespace KG
{
	export struct RenderSetting;

	//----------------------------------------------------------------------
	//! @brief 렌더러 코어 인터페이스
	//----------------------------------------------------------------------
	export class RenderCore
	{
		//----------------------------------------------------------------------
		//! @brief 초기화한다.
		//! @return 초기화 성공 여부
		//----------------------------------------------------------------------
		bool Initialize( const KG::RenderSetting& InRenderSetting );

	};
}
